In [2]:
## 1. Create and display a pandas series containing the first 5 prime numbers

import pandas as pd
prime_ser = pd.Series([2,3,5,7,11])
print(prime_ser)

0     2
1     3
2     5
3     7
4    11
dtype: int64

In [3]:
## 2. Create two series of first 5 prime numbers and first 5 composite numbers respectively, and perform multiplication on both

prime_ser = pd.Series([2,3,5,7,11])
comp_ser = pd.Series([4,6,8,9,10])
prod_ser = prime_ser * comp_ser
print(prod_ser)

0      8
1     18
2     40
3     63
4    110
dtype: int64

In [4]:
## 3. Retrieve the 3rd and 4th series elements from the composite number series created in the previous question

print(comp_ser[2:4])

2    8
3    9
dtype: int64

In [5]:
## 4. Add the composite number series created to the prime number series

num_ser = prime_ser.append(comp_ser)
print(num_ser)

0     2
1     3
2     5
3     7
4    11
0     4
1     6
2     8
3     9
4    10
dtype: int64

C:\Users\nithyalakshmim\AppData\Local\Temp\ipykernel_50328\1401507175.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  num_ser = prime_ser.append(comp_ser)

In [6]:
## 5. From the prime number series created in Q1, remove the even prime number
new_prime_ser = prime_ser.drop(0)
print(new_prime_ser)

1     3
2     5
3     7
4    11
dtype: int64

In [7]:
## 6. Create a dataframe of five employees with their monthly salary from a dictionary of lists
emp_sal = {'Name':['Anna','John','Smith','Jessie','Shawn'], 'Salary':[600,756,587,859,990]}
df = pd.DataFrame(emp_sal)

df

     Name  Salary
0    Anna     600
1    John     756
2   Smith     587
3  Jessie     859
4   Shawn     990

In [8]:
## 7. From the employee dataframe created in Q7, extract the salary column alone

df['Salary']

0    600
1    756
2    587
3    859
4    990
Name: Salary, dtype: int64

In [9]:
## 8. Revise the column names of the employee dataframe to "First_Name" and "Monthly_Salary"
df.rename(columns={'Name':'First_Name','Salary':'Monthly_Salary'}, inplace=True)
df

  First_Name  Monthly_Salary
0       Anna             600
1       John             756
2      Smith             587
3     Jessie             859
4      Shawn             990

In [15]:
## 9. Read the csv file called "starbucks_final" into a pandas dataframe, and display the first five records
oj= pd.read_csv("D://Files//oj.csv")
oj.head()

,store,brand,week,logmove,feat,price,AGE60,EDUC,ETHNIC,INCOME,HHLARGE,WORKWOM,HVAL150,SSTRDIST,SSTRVOL,CPDIST5,CPWVOL5
0,2,tropicana,40,9.018695,0,3.87,0.232865,0.248935,0.11428,10.553205,0.103953,0.303585,0.463887,2.110122,1.142857,1.92728,0.376927
1,2,tropicana,46,8.723231,0,3.87,0.232865,0.248935,0.11428,10.553205,0.103953,0.303585,0.463887,2.110122,1.142857,1.92728,0.376927
2,2,tropicana,47,8.253228,0,3.87,0.232865,0.248935,0.11428,10.553205,0.103953,0.303585,0.463887,2.110122,1.142857,1.92728,0.376927
3,2,tropicana,48,8.987197,0,3.87,0.232865,0.248935,0.11428,10.553205,0.103953,0.303585,0.463887,2.110122,1.142857,1.92728,0.376927
4,2,tropicana,50,9.093357,0,3.87,0.232865,0.248935,0.11428,10.553205,0.103953,0.303585,0.463887,2.110122,1.142857,1.92728,0.376927

In [13]:
## 10. Print the descriptive statistics of the oj dataframe

oj.describe()

,store,week,logmove,feat,price,AGE60,EDUC,ETHNIC,INCOME,HHLARGE,WORKWOM,HVAL150,SSTRDIST,SSTRVOL,CPDIST5,CPWVOL5
count,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000,28947.000000
mean,80.883511,100.459944,9.167864,0.237261,2.282488,0.173130,0.225220,0.155557,10.616735,0.115602,0.359178,0.343766,5.097274,1.207317,2.120359,0.438914
std,35.576511,34.692314,1.019378,0.425411,0.648001,0.061872,0.109945,0.187581,0.282314,0.030168,0.052673,0.239028,3.472386,0.526528,0.729828,0.219248
min,2.000000,40.000000,4.158883,0.000000,0.520000,0.058054,0.049550,0.024247,9.867083,0.013506,0.244463,0.002509,0.132097,0.400000,0.772530,0.094562
25%,53.000000,70.000000,8.489616,0.000000,1.790000,0.122100,0.145985,0.041910,10.456079,0.097938,0.312636,0.123486,2.767046,0.727273,1.626192,0.271673
50%,86.000000,101.000000,9.034080,0.000000,2.170000,0.170655,0.229390,0.074656,10.635326,0.111221,0.355635,0.346154,4.650687,1.115385,1.963412,0.383227
75%,111.000000,130.000000,9.764685,0.000000,2.730000,0.213949,0.284395,0.187761,10.796960,0.135168,0.402313,0.528313,6.650602,1.538462,2.533672,0.560240
max,137.000000,160.000000,13.482016,1.000000,3.870000,0.307398,0.528362,0.995691,11.236197,0.216354,0.472308,0.916699,17.855951,2.571429,4.107902,1.143367

In [16]:
oj.dtypes

store         int64
brand        object
week          int64
logmove     float64
feat          int64
price       float64
AGE60       float64
EDUC        float64
ETHNIC      float64
INCOME      float64
HHLARGE     float64
WORKWOM     float64
HVAL150     float64
SSTRDIST    float64
SSTRVOL     float64
CPDIST5     float64
CPWVOL5     float64
dtype: object

In [17]:
## 11. Change the data type of "logmove" column from float to int

oj['logmove'] = oj['logmove'].astype('int64')
oj.dtypes

store         int64
brand        object
week          int64
logmove       int64
feat          int64
price       float64
AGE60       float64
EDUC        float64
ETHNIC      float64
INCOME      float64
HHLARGE     float64
WORKWOM     float64
HVAL150     float64
SSTRDIST    float64
SSTRVOL     float64
CPDIST5     float64
CPWVOL5     float64
dtype: object

In [19]:
## 12. Retrieve the 5th record pertaining to the "store" column alone the oj dataframe
oj.iloc[[4]]['store']

4    2
Name: store, dtype: int64

In [20]:
## Alternatively, using loc
oj.loc[[4]]['store']

4    2
Name: store, dtype: int64

In [ ]:
## end of notebook